
"AppName" = "DoXLogic";
"Settings" = "Настройки";
"SettingsDone" = "Готово";

"Errors" = "Ошибки";
"Messages" = "Сообщения";

"Error" = "Ошибка";
"Attention" = "Внимание!";

"Employes" = "Сотрудники";
"Executors" = "Исполнители";
"DocList" = "Список документов";
"DocShowing" = "Просмотр документа";
"Show" = "Показать";
"High" = "Высокий";
"Normal" = "Обычный";
"DocNotFound" = "Документ не найден";
"DocInfo" = "Информация о документе";
"DocProcessed" = "Обработанные документы";
"Urgent" = "Срочно";
"Rotation" = "Поворот";

"AgreementList" = "Лист согласования";
"AgreementListHistory" = "История согласования";
"ExecutionList" = "Лист исполнения";
"MainDoc" = "Основной документ";
"Supplement" = "Приложение %d";
"LinkedDocsHeader" = "Связанные документы:";
"FromChildItemsHeader" = "Результаты:";
"strAddToCurrentTask" = "Добавить в текущее поручение";
"AddTask" = "Добавить поручение";
"LinkedNoDoc1" = "Документ(%d)";
"LinkedNoDoc2" = "(просмотр невозможен)";
"ToAddFromChildsBtnTitle" = "Добавить";

"NoPsw" = "Не задан пароль";
"WrongPsw" = "Неверный пароль";

"Approving" = "Утверждаю";
"NotApproving" = "Не утверждаю";

"Agreeing" = "Согласен";
"NotAgreeing" = "Не согласен";

"AddComment" = "Добавьте комментарий";
"AddCommentTail" = " (обязательное поле)";
"AddToTemplate" = "Добавить в шаблон";

"Loading" = "Загрузка";
"Document" = "документа";
"Document0" = "Документ";
"TaskInNavig" = "Поручение";
"ChildTaskDocTitle" = "Исп. ";

"NoServerName" = "Не задано имя сервера";
"WrongServerName" = "Неверный IP адрес сервера '%@'";
"NoPort" = "Не задан порт сервера";
"NoApplicationName" = "Не задано имя приложения";
"NoResourceName" = "Не задано имя ресурса";
"NoRoleId" = "Не задана роль пользователя";
"NoUserName" = "Не задано имя пользователя";
"NoUserPsw" = "Не задан пароль пользователя";
"NoFirstTimeUserPsw" = "При первом запуске для нового пользователя пароль должен быть задан";
"ChangedPswMsg" = "Пароль был изменен. Необходима синхронизация с СЭД";

"NoGDAppServerPortName" = "Имя сервера и порт должны быть заданы из списка\n%@";

"NoSTunnelServerName" = "Не задано имя сервера защищенного соединения";
"NoSTunnelPort" = "Не задан порт сервера защищенного соединения";

"EClassError" = "Ошибка загрузки типов поручений";

"Synchronizing" = "Синхронизация";
"SynchFinishedOK" = "Синхронизация успешно завершена";
"ErrorServerAuthorization" = "Авторизации на сервере";

"AssignController" = "Назначить контролера";
"AssignExecutor" = "Назначить исполнителя";
"ExecutorsEmpty" = "Список исполнителей пуст";
"ResolutionTextEmpty" = "Не задан текст резолюции";
"ResolutionDateEmpty" = "Не задана дата";
"ResolutionDateWrong" = "Выберите более позднюю дату";
"ResolutionDelete" = "Вы хотите удалить резолюцию(и)?";
"Resolution" = "Резолюция";
"ResolutionMore" = "Резолюция…";
"ResolutionColon" = "Резолюция:";
"ResolutionsListCancel" = "Вы действительно хотите отменить принятые решения? Все внесенные изменения будут утеряны";
"ResolutionsListCancelChanges" = "Вы действительно хотите отказаться от внесенных изменений ?";
"ResolutionCancelChanges" = "Все внесенные изменения будут удалены. Вы хотите продолжить ?";
"ResolutionNoResWarning" = "Вы действительно хотите завершить исполнение поручения без наложения резолюции ?";
"ResolutionNoResExecuted" = "рассмотрено";
"ChildTaskTitle" = "Поручение \"в рамках\"";
"ChildTaskCommentHeader" = "Комментарий исполнителя:";
"AddFromChildTasksHeader" = "Добавление из поручений";

"Yes" = "Да";
"No" = "Нет";

"ConfirmDataDeletion" = "Вы действительно хотите удалить данные с устройства ?";
"ConfirmTemplateDeletion" = "Вы действительно хотите удалить выделенный шаблон ?";

"RequestGroupName_Spravochnikov" = "Получение параметров и справочников";
"RequestGroupName_SendTasks" = "Отправка поручений";
"RequestGroupName_Certificates" = "Отправка/получение сертификатов";
"RequestGroupName_MainDocsList" = "Получение списка основных документов";
"RequestGroupName_MainDocs" = "Получение основных документов";
"RequestGroupName_AcquDocs" = "Получение документов на ознакомление";
"RequestGroupName_LinkDocs" = "Получение связанных документов";

"RequestName_Version" = "Запрос версии";
"RequestName_CheckPsw" = "Проверка пароля";
"RequestName_Employee" = "запрос сотрудников";
"RequestName_Affilate" = "запрос аффилянтов";
"RequestName_Autotext" = "запрос автотекста";
"RequestName_EClass" = "запрос е-класса";
"RequestName_Attach" = "запрос файла";
"RequestName_Config" = "запрос параметров";
"RequestName_ExecTask" = "запрос выполнения поручения";
"RequestName_AssignTask" = "запрос делегирования";
"RequestName_DocList" = "запрос документов";
"RequestName_Login" = "запрос авторизации";
"RequestName_AutotextUpload" = "запрос  обновления автотекста";
"RequestName_TaskList" = "запрос поручений";
"RequestName_DocLinkTypes" = "запрос типов связанных документов";
"RequestName_AcceptExecution" = "запрос принятия результатов";

"RequestName_AcquaintanceFolders" = "запрос папок на ознакомление";
"RequestName_DeleteFolder" = "запрос удаления папки";
"RequestName_MoveDocument" = "запрос  перемещения документа";
"RequestName_AcquaintanceFolderDocuments" = "запрос документов на ознакомление";

"RequestName_CertificateRequest" = "запрос сертификата";
"RequestName_CertificateDownload" = "запрос  загрузки сертификата";
"RequestName_CertificateAckDownload" = "запрос  подтверждения загрузки сертификата";
"RequestName_CertificateCheckDownload" = "запрос проверки сертификата";
"RequestName_Version" = "запрос версии";

"ServerNoData" = "На %@ сервер не прислал никаких данных";
"ServerBadData" = "На %@ получена ошибка '%@'";
"ServerVersionNoData" = "На сервере в файле «buildForMobile.nfo» отсутствует или некорректно указан номер версии. Обратитесь к администратору.";
"ServerVersionHigh" = "Версия приложения устарела. Необходимо обновить версию программы с AppStore";

"ForAgreement" = "На согласование";
"ForReview" = "На подпись";
"ForApproval" = "На рассмотрение";
"ForAcquaintance" = "На ознакомление";
"ForAcceptExecution" = "На принятие результата";
"ForTaskRead" = "На ознакомление";
"ForExecution" = "На исполнение";

"ListNameForAgreement" = "Документы на согласование";
"ListNameForReview" = "Документы на подпись";
"ListNameForApproval" = "Документы на рассмотрение";
"ListNameForAcquaintance" = "Документы на ознакомление";
"ListNameForAcceptExecution" = "Документы на принятие результата";
"ListNameForTaskRead" = "Документы на ознакомление";
"ListNameForExecution" = "Документы на исполнение";

"strCatchedException" = "Ошибка";
"strSendLogToDeveloper" = "Отошлите лог-файл разработчикам";
"ProgramCrash" = "Сбой программы";
"Description" = "Описание:\n%@";
"Close" = "Закрыть";
"DifferentProxyNames" = "Имена пользователя для прокси сервера (а возможно и пароли) в системных настройках сетевого соединения и настройках программы не совпадают";
"NoInetConnection" = "Интернет отключен";
"NoServerConnection" = "Отсутствует соединение с сервером %@\n\nОбычно это вызвано проблемами с сетью или с подключением через VPN.\nТакже возможно недоступен сервер СЭД или неверно заданы его имя/порт в настройках приложения.\n\nЕсли ошибка повторится, обратитесь к администратору.\n\n";
"AuthNamePswError" = "Неверное имя или пароль при авторизации на сервере %@\n\nВ случае работы сетевого соединения через прокси, проверьте корректность настроек прокси и что точно такие же значения имя/пароля указаны в настройках приложения в разделе «Авторизация через прокси».\n\nТакже эта ошибка может быть вызвана проблемами при дополнительной авторизации на сервере. В этом случае необходимо проверить, что в настройках приложения, в разделе «Дополнительная авторизация на сервере» указаны корректные имя/пароль.";
"NoServerVersion" = "При запросе версии сервера произошла ошибка '%@'";
"NoSupportedServerVersion" = "На сервере в файле «buildForMobile.nfo» указан более старый номер версии, чем версия приложения.\n\nОбычно это вызвано тем, что на сервере был ошибочно изменен номер версии на более старый.\n\nЕсли вы действительно хотите соединиться с сервером, вам необходимо установить в настройках приложения признак «Удалите данные при следующем входе» и заново войти в приложение";
"ServerVersionIncreased" = "Версия системы была обновлена.  Для корректной работы требуется перезапустить приложение.";
"ServerVersionNoMiddleVersionContainer" = "Версия СЭД «%@» приложением не поддерживается.\n\nВозможно, на сервере не обновлена система электронного документооборота или некорректно установлен номер версии в файле «buildForMobile.nfo».\n\nОбратитесь к администратору.";

"EndUserWork" = "Завершение работы с пользователем %@. При следующем запуске программы будем работать под пользователем %@.";
"EndServerWork" = "Завершение работы с сервером %@. При следующем запуске программы будем работать с сервером %@.";
"EndAppWork" = "Завершение работы с приложением %@. При следующем запуске программы будем работать с приложением %@.";
"EndResWork" = "Завершение работы с ресурсом %@. При следующем запуске программы будем работать с ресурсом %@.";
"EndWorkPswChanged" = "Завершение работы из-за смены пароля";
"EndWorkForDataErase" = "Завершение работы для удаления данных при старте";
"EndWorkSTunnelChanged" = "Завершение работы из-за смены параметров защищенного соединения";

"CancelDelegationOld" = "Отменить делегирование";
"CancelDelegation" = "Отменить передачу";
"CancelResolution" = "Отменить резолюцию";
"CancelAgree" = "Отменить согласование";
"CancelApproval" = "Отменить утверждение";
"DocumentProcessed" = "Документ уже обработан в системе.";
"TaskIsUploading" = "Поручение посылается на сервер";
"Date" = "Дата: %@";
"ExecutorList" = "Список исполнителей (%d)";
"DataNotSet" = "Не задана";
"RequestTimeout" = "Отсутствует связь с сервером";
"CommentNotEmpty" = "Комментарий не должен быть пустым !";
"CancelDecision" = "Отменить решение";
"CommentShouldBeEmpty" = "Заполнено поле 'Комментарий'. Вы действительно хотите согласовать документ ?";

"CommentsTemplatesHead" = "Шаблоны комментариев";

"AutoTextHead" = "Шаблоны резолюций";
"UseAutoTexts" = "Использовать шаблон резолюции:";
"DocAcquaintance" = "Ознакомление с документом";
"AddResolution" = "Добавить поручение";
"ExecutorsColon" = "Исполнители:";
"ExecutorColon" = "Исполнитель:";
"Executors2" = "Исполнители";
"ExecutionDate" = "Срок исполнения:";
"ExecutionDateNew" = "Срок:";
"Dated" = " от %@";
"DateDeliver" = "Получено %@";
"FormalInfo" = "%@ (срок до %@): %@";
"ChoosingExecutors" = "Выбор исполнителей";
"EnterProgram" = "Вход в программу DoXLogic";
"ToEnterProgram" = "Войти в программу DoXLogic";
"Canceling" = "Отмена";
"Delegated" = "Передан";
"Delegate" = "Передать";
"DelegatedTo" = "Передано:";
"Considered" = "Рассмотрен";
"Agreed" = "Согласован";
"NotAgreed" = "Не согласован";
"Approved" = "Утвержден";
"NotApproved" = "Не утвержден";
"Calendar" = "Календарь";
"ToMain" = "На главную";
"Finished" = "Завершена";
"Considered2" = "Рассмотрено";
"ConfirmExecution" = "Подтвердить\nисполнение";
"ToExecute" = "Исполнить";
"PoruchenieAgreed" = "Согласовано";
"PoruchenieNotAgreed" = "Не согласовано";

"ResposibleColon" = "Ответственный:";
"ResponsibleZaSvod" = "Ответственный за свод:";
"SelectResposible" = "Назначить ответственного";
"strCheckExecResult" = "Проконтролировать результат";

"More" = "Подробнее…";
"ToHide" = "Скрыть";
"Cancel" = "Отмена";
"Designate" = "Назначить";
"ToCancel" = "Отменить";

"UserName" = "Имя пользователя";
"Psw" = "Пароль";

"Commentary" = "Комментарий:";

"Erase" = "Удалить";
"MsgsLog" = "Журнал сообщений";
"ResolutionInitialText" = "Введите текст резолюции";
"Save" = "Сохранить";
"ToEdit" = "Редактировать";
"NotSet" = "Не задан";
"Confirm" = "Подтвердить";
"ChildTaskIssued" = "Выданы поручения";

"HTTPError" = "HTTP ошибка '%@' (код %d)";

"Delete" = "Удалить";
"Change" = "Изменить";

"AcquRemove" = "Удалить (%d)";
"AcquMove" = "Переместить (%d)";
"AcquReadYes" = "Прочитано (%d)";
"AcquReadNo" = "Не прочитано (%d)";

"AcquRemove1" = "Удалить";
"AcquMove1" = "Переместить";
"AcquReadYes1" = "Прочитано";
"AcquReadNo1" = "Не прочитано";
"AcquReadYesNew" = "Отметить как прочитанное";
"AcquReadNoNew" = "Отметить как не прочитанное";//warning - no break space
"AcquReadYesCounted" = "Отметить как прочитанное\n%d";
"AcquReadNoCounted" = "Отметить как не прочитанное\n%d";//warning - no break space
"AcquRemoveCounted" = "Удалить\n%d";
"AcquMoveCounted" = "Переместить\n%d";
"AcquMoveCancel0" = "⨂ отмена";
"AcquMoveCancel" = "Отмена ⊗";

"ViewMsgsInLog" = "При выполнении процедуры синхронизации получены сообщения. Подробнее в журнале сообщений.";

"TimeLeft1" = "%d сек";
"TimeLeft2" = "%d мин %d сек";
"TimeLeft3" = "%d час(а) %d мин";
"TimeLeft4" = "%d мин";
"FileLeft" = "%d из %d";

"DocTypeInput" = "Входящие";
"DocTypeOutput" = "Исходящие";
"DocTypeInternal" = "Внутренние";
"DocTypeInputShort" = "Вх.";
"DocTypeOutputShort" = "Исх.";
"DocTypeInternalShort" = "Вн.";

"strCorrespondent" = "Корреспондент: %@";
"strAddresse" = "Адресат: %@";

"CryptoProSettingsTitle" = "Настройка КриптоПро";
"RSASettingsTitle" = "Настройка RSA";
"DocWillBeDigSigned" = "Внимание! Документ будет подписан электронной подписью.";
"DocCannotDigSigned" = "Внимание! Документ требует электронной подписи. Замените недействительный сертификат.";
"DocShouldInstallCertificate" = "Внимание! Документ требует электронной подписи. Установите сертификат.";
"WillNeverSign" = "Невозможно завершить операцию с заверением результата ЭЦП. Сертификат не найден на устройстве.";
"NoCertificate" = "Не установлен(или не выбран текущий) сертификат цифровой подписи.";
"ErrorSigningDocument" = "Ошибка цифрового подписания документа 0x%X";
"ErrorSigningTask" = "Ошибка цифрового подписания поручения 0x%X";
"CertificateDaysRemain" = "До окончание срока сертификата осталось %@.";
"CertificateNotBegin" = "Срок действия сертификата еще не начался. Необходимо дождаться начала срока действия сертификата %@.";
"CertificateExpired" = "Срок действия сертификата истек %@. Необходимо произвести замену.";
"SendCertificateRequest" = "Сформировать запрос на сертификат";

"CertSurName" = "Фамилия:";
"CertName" = "Имя:";
"CertOtchestvo" = "Отчество:";
"CertCN" = "Общее имя:";
"CertCountry" = "Страна:";
"CertRegion" = "Область:";
"CertLocality" = "Город:";
"CertStreet" = "Адрес:";
"CertOrganization" = "Организация:";
"CertSubDivision" = "Подразделение:";
"CertTitle" = "Должность:";
"CertEMail" = "Электронная почта:";
"CertOGRN" = "ОГРН:";
"CertSNILS" = "СНИЛС:";
"CertINN" = "ИНН:";
"CertEnterField" = "Задайте поле '%@'";
"CertFieldLength" = "Длина поля '%@' больше %d";
"CertReqView" = "Запрос на сертификат";
"CertReqCreated" = "Сформирован %@";
"CertReqSent" = "Запрос на сертификат: отправлен %@, ожидает ответа.";
"CertReqCreateError" = "Ошибка создания запроса на сертификат 0x%X";
"CertReceived" = "Запрос на сертификат: сертификат получен %@.";
"CertErrorReceived" = "Запрос на сертификат: %@.";
"CertInstallError" = "Ошибка 0x%X при установке сертификата";
"CertReqSendError" = "При отправке запроса на сертификат произошла неизвестная ошибка. Обратитесь к системному администратору.";
"CertGetError" = "При получении сертификата произошла неизвестная ошибка. Обратитесь к системному администратору.";

"CertViewTitle" = "Сертификаты";
"CertViewInterval" = "Срок действия";
"CertViewName" = "Кому выдан";
"CertViewHash" = "Отпечаток";
"CertViewCurrent" = "Текущий";

"AcquaintanceFolders" = "Папки (%d)";
"AcquaintanceFolderDelete" = "Папка '%@' содержит документы. Удалить ?";
"AcquaintanceFolderNoDocsDelete" = "Удалить папку '%@' ?";
"AcquaintanceFolderRootNoDelete" = "Корневая папка '%@' не подлежит удалению";
"DocInAcquaintanceFolderDelete" = "Удалить документ %@ ?";
"DocsInAcquaintanceFolderDelete" = "Удалить выделенные документы?";
"Folders" = "Папки";
"Dates" = "Сроки";
"Lock" = "Закрепить";
"Unlock" = "Свернуть";
"ShowFolderContentsAll" = "Все документы";

"WrongURL" = "Параметры сервера документооборота заданы неверно '%@'";

"DocGrouping0" = "Все (%d)";
"DocGrouping1" = "Ранее (%d)";
"DocGrouping2" = "Сегодня (%d)";
"DocGrouping3" = "Завтра (%d)";
"DocGrouping4" = "Эта неделя (%d)";
"DocGrouping5" = "След. неделя (%d)";
"DocGrouping6" = "Позже (%d)";

"SwitchToProcessed" = "Обработанные %@";
"SwitchToUnprocessed" = "Необработанные %@";

"DatePlanEnd" = "Срок %@";
"AllFolders" = "Все документы";
"ChooseFolderToMove" = "Выберите папку для перемещения";

"SkipPresentationFolderName1" = "Выданные мне";
"SkipPresentationFolderName2" = "Выданные мной";

"Error912" = "Невозможно отобразить документ, так как он имеет некорректный формат.";
"ErrorDocShow" = "При отображении документа произошла ошибка - %@.";

"NoMoveFromAllDocsFolder" = "Перемещение из папки в папку невозможно из общего списка документов";

"ResolutionReportButtonTitleToEdit" = "Изменить";
"ResolutionReportButtonTitleToSave" = "Сохранить";

"strAudioTitle" = "Голосовая резолюция";
"strRecordAudio" = "Добавить голосовую резолюцию";
"strStopRecord" = "Остановить запись";
"strPlayAudio" = "Воспроизвести голосовую резолюцию";
"strStopPlay" = "Остановить воспроизведение";
"strRecordAborted" = "Запись была остановлена";
"strAskAbortRecord" = "Идет запись на диктофон. Закончить?";

"strScribbleTitle" = "Рукописная резолюция";
"strScribbleAdd" = "Добавить рукописную резолюцию";
"strScribbleShow" = "Просмотреть рукописную резолюцию";

"strAttNotLoaded" = "Документ %@ не загружен файл %@ из-за установленного ограничения по допустимому размеру вложения";
"strAttAndSize" = "\"%@\" (%0.2fМб)";
"strAttCantShow" = "Просмотр невозможен";

"strCannotAssignTask" = "Передача другому исполнителю невозможна. У этого поручения есть дочерние поручения.";
"strAllowAutoComplete" = "Разрешить автозакрытие";
"strAutoCompleteInfo" = "При исполнении всех выданных поручений Ваше поручение будет завершено автоматически";

"strEnterContPassword" = "Введите пароль на контейнер для его сохранения и использования в дальнейшем при подписании документов. Оставьте поле пустым, если пароль отсутствует или Вы не хотите его сохранять.";

"strDeviceUserNamePlaceHolder" = "Пользователь iPad";

"strAllExecutors" = "Исполнители:";
"strSelectedxecutors" = "Выбранные исполнители:";
"strExecutor" = "Исполнитель";
"strAuthor" = "(Автор)";
"strPlanDate1" = "Плановый";
"strPlanDate2" = "срок";
"strFactDate" = "Исполнено";
"strResolComment" = "Резолюция/Комментарий";
"strChildTaskAuthor" = "Автор поручения:";

"strAcceptResult" = "Принять\nрезультат";
"strReturnToRevision" = "Вернуть на\nдоработку";
"strAcceptExecCounts" = "Принято:%d Возвращено:%d";
"strReturnToRevisionNoCR" = "Вернуть на доработку";
"strAcceptResultYes" = "Принято";
"strAcceptResultNo" = "Не принято";
"strAcceptExecDateHeader_Executed" = "Исполнено:";
"strAcceptExecDateHeader_Agreed" = "Согласовано:";
"strAcceptExecDateHeader_NotAgreed" = "Не согласовано:";

"strTimeLeft" = "Осталось времени : %@";

"strDigAlgoViewTitle" = "Алгоритм электронной подписи";
"strDigAlgoGost" = "Алгоритм ГОСТ (КриптоПро)";
"strDigAlgoRSA" = "Алгоритм RSA";
"IvalidRSACertificateData" = "Неверные DER-кодированные данные сертификата";
"strCertificateInstalled" = "Сертификат установлен";
"strCertificateNotFound" = "Не найден cертификат %@";
"strCryptoAlgoChanged" = "Алгоритм электронной подписи изменен. Для корректной работы требуется перезапустить приложение.";
"RSACertInstallError" = "Ошибка %d при установке сертификата";

"strNoServerForSTunnel" = "Не задано имя сервера для тунельного соединения";
"strNoPortForSTunnel" = "Не задан порт для тунельного соединения";
"strErrorStartingSTunnel" = "Ошибка %d при запуске тунельного соединения";

"strSwitchToAM"="Рецензировать";
"strAnnotationView"="Режим рецензирования вложения";
"strChooseAnnotationFileView"="Выбор вложения для рецензирование";
"strExternalAnnotationFileName"="(с правками %@ от %@)";

"strConsolidated"="На исполнение (сводное)";

"strConfirmRead" = "Подтвердить\nознакомление";
"strConfirmReadNoCR" = "Подтверждение ознакомления";
"strConfirmReaded" = "Ознакомлен";

"strNotAllEClassesLoaded" = "Загружены не все Е-классы";

"strTaskAuthor" = "Автор поручения:";
"strShowDocTasks" = "Выданные Вам\nпоручения";
"strResHeaderForExecution" = "Результат исполнения поручения";
"strExecuted" = "Исполнен";
"strMaterialsAreAbscent" = "Материалы отсутствуют";
"strBack" = "Назад";

"strDocFrom" = "От:";
"strDocTo" = "Кому:";
"strLabelForAcceptExecution" = "На принятие результата";
"strLabelForAcceptExecution1" = "Принято";
"strLabelForAcceptExecution0" = "Не принято";
"strConfirmCancelAnnotation" = "Вы уверены? Изменения не будут сохранены";

"strTaskViewTitle" = "Поручение по документу";

"strCantShowAttachment" = "Невозможно отобразить вложение поскольку оно не полностью загружено";
